; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-4-3-30)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p0-2 - location
	p0-4 - location
	p0-5 - location
	p1-0 - location
	p2-3 - location
	p2-6 - location
	p4-1 - location
	p4-3 - location
	p6-0 - location
	p6-1 - location
	p6-7 - location
	p7-3 - location
	p7-5 - location
	)
	(:init
	(at driver1 s5)
	(at driver2 s1)
	(at driver3 s6)
	(at driver4 s6)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s3)
	(empty truck2)
	(at truck3 s7)
	(empty truck3)
	(at package1 s3)
	(at package2 s2)
	(at package3 s2)
	(at package4 s3)
	(at package5 s4)
	(at package6 s7)
	(at package7 s3)
	(at package8 s5)
	(at package9 s1)
	(at package10 s1)
	(at package11 s4)
	(at package12 s1)
	(at package13 s5)
	(at package14 s3)
	(at package15 s4)
	(at package16 s5)
	(at package17 s6)
	(at package18 s6)
	(at package19 s2)
	(at package20 s5)
	(at package21 s2)
	(at package22 s0)
	(at package23 s0)
	(at package24 s7)
	(at package25 s1)
	(at package26 s0)
	(at package27 s3)
	(at package28 s0)
	(at package29 s7)
	(at package30 s4)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(path s6 p6-7)
	(path p6-7 s6)
	(path s7 p6-7)
	(path p6-7 s7)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s1 s3)
	(link s3 s1)
	(link s1 s6)
	(link s6 s1)
	(link s3 s0)
	(link s0 s3)
	(link s3 s4)
	(link s4 s3)
	(link s3 s6)
	(link s6 s3)
	(link s4 s1)
	(link s1 s4)
	(link s4 s6)
	(link s6 s4)
	(link s5 s1)
	(link s1 s5)
	(link s6 s2)
	(link s2 s6)
	(link s6 s7)
	(link s7 s6)
	(link s7 s0)
	(link s0 s7)
	(link s7 s1)
	(link s1 s7)
	(link s7 s2)
	(link s2 s7)
	(link s7 s4)
	(link s4 s7)
	(link s7 s5)
	(link s5 s7)
)
	(:goal (and
	(at driver2 s1)
	(at driver3 s7)
	(at truck1 s3)
	(at truck2 s7)
	(at truck3 s2)
	(at package1 s0)
	(at package2 s2)
	(at package3 s6)
	(at package5 s5)
	(at package6 s3)
	(at package8 s2)
	(at package9 s6)
	(at package10 s5)
	(at package11 s0)
	(at package12 s3)
	(at package13 s5)
	(at package14 s1)
	(at package15 s6)
	(at package16 s5)
	(at package17 s1)
	(at package18 s7)
	(at package19 s0)
	(at package20 s1)
	(at package21 s5)
	(at package22 s7)
	(at package23 s5)
	(at package24 s0)
	(at package25 s5)
	(at package26 s2)
	(at package27 s1)
	(at package28 s7)
	(at package29 s2)
	(at package30 s7)
	))


)

; plan
1. (walk driver1 s5 p0-5)
   deleted: (at driver1 s5)
   added: (at driver1 p0-5)
   goals met: 4 of 33
2. (walk driver1 p0-5 s0)
   deleted: (at driver1 p0-5)
   added: (at driver1 s0)
   goals met: 4 of 33
3. (board-truck driver1 s0 truck1)
   deleted: (at driver1 s0) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 4 of 33
4. (drive-truck driver1 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 4 of 33
5. (load-truck s1 package9 truck1)
   deleted: (at package9 s1)
   added: (in package9 truck1)
   goals met: 4 of 33
6. (load-truck s1 package25 truck1)
   deleted: (at package25 s1)
   added: (in package25 truck1)
   goals met: 4 of 33
7. (load-truck s1 package12 truck1)
   deleted: (at package12 s1)
   added: (in package12 truck1)
   goals met: 4 of 33
8. (load-truck s1 package10 truck1)
   deleted: (at package10 s1)
   added: (in package10 truck1)
   goals met: 4 of 33
9. (drive-truck driver1 s1 s7 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s7)
   goals met: 4 of 33
10. (load-truck s7 package6 truck1)
   deleted: (at package6 s7)
   added: (in package6 truck1)
   goals met: 4 of 33
11. (load-truck s7 package29 truck1)
   deleted: (at package29 s7)
   added: (in package29 truck1)
   goals met: 4 of 33
12. (load-truck s7 package24 truck1)
   deleted: (at package24 s7)
   added: (in package24 truck1)
   goals met: 4 of 33
13. (walk driver3 s6 p6-7)
   deleted: (at driver3 s6)
   added: (at driver3 p6-7)
   goals met: 4 of 33
14. (drive-truck driver1 s7 s0 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s0)
   goals met: 4 of 33
15. (drive-truck driver1 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 5 of 33
16. (unload-truck s3 package6 truck1)
   deleted: (in package6 truck1)
   added: (at package6 s3)
   goals met: 6 of 33
17. (load-truck s3 package27 truck1)
   deleted: (at package27 s3)
   added: (in package27 truck1)
   goals met: 6 of 33
18. (load-truck s3 package14 truck1)
   deleted: (at package14 s3)
   added: (in package14 truck1)
   goals met: 6 of 33
19. (drive-truck driver1 s3 s1 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 5 of 33
20. (unload-truck s1 package27 truck1)
   deleted: (in package27 truck1)
   added: (at package27 s1)
   goals met: 6 of 33
21. (unload-truck s1 package14 truck1)
   deleted: (in package14 truck1)
   added: (at package14 s1)
   goals met: 7 of 33
22. (walk driver3 p6-7 s7)
   deleted: (at driver3 p6-7)
   added: (at driver3 s7)
   goals met: 8 of 33
23. (board-truck driver3 s7 truck3)
   deleted: (at driver3 s7) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 7 of 33
24. (drive-truck driver1 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 7 of 33
25. (load-truck s0 package28 truck1)
   deleted: (at package28 s0)
   added: (in package28 truck1)
   goals met: 7 of 33
26. (load-truck s0 package26 truck1)
   deleted: (at package26 s0)
   added: (in package26 truck1)
   goals met: 7 of 33
27. (unload-truck s0 package24 truck1)
   deleted: (in package24 truck1)
   added: (at package24 s0)
   goals met: 8 of 33
28. (load-truck s0 package23 truck1)
   deleted: (at package23 s0)
   added: (in package23 truck1)
   goals met: 8 of 33
29. (drive-truck driver1 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 8 of 33
30. (drive-truck driver1 s2 s6 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   goals met: 8 of 33
31. (unload-truck s6 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s6)
   goals met: 9 of 33
32. (load-truck s6 package18 truck1)
   deleted: (at package18 s6)
   added: (in package18 truck1)
   goals met: 9 of 33
33. (drive-truck driver1 s6 s4 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s4)
   goals met: 9 of 33
34. (load-truck s4 package5 truck1)
   deleted: (at package5 s4)
   added: (in package5 truck1)
   goals met: 9 of 33
35. (drive-truck driver1 s4 s7 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s7)
   goals met: 9 of 33
36. (drive-truck driver1 s7 s5 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s5)
   goals met: 9 of 33
37. (load-truck s5 package8 truck1)
   deleted: (at package8 s5)
   added: (in package8 truck1)
   goals met: 9 of 33
38. (unload-truck s5 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s5)
   goals met: 10 of 33
39. (drive-truck driver1 s5 s7 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s7)
   goals met: 10 of 33
40. (drive-truck driver1 s7 s2 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s2)
   goals met: 10 of 33
41. (unload-truck s2 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s2)
   goals met: 11 of 33
42. (load-truck s2 package3 truck1)
   deleted: (at package3 s2)
   added: (in package3 truck1)
   goals met: 11 of 33
43. (drive-truck driver1 s2 s6 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   goals met: 11 of 33
44. (unload-truck s6 package3 truck1)
   deleted: (in package3 truck1)
   added: (at package3 s6)
   goals met: 12 of 33
45. (load-truck s6 package17 truck1)
   deleted: (at package17 s6)
   added: (in package17 truck1)
   goals met: 12 of 33
46. (drive-truck driver1 s6 s1 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s1)
   goals met: 12 of 33
47. (unload-truck s1 package17 truck1)
   deleted: (in package17 truck1)
   added: (at package17 s1)
   goals met: 13 of 33
48. (drive-truck driver3 s7 s2 truck3)
   deleted: (at truck3 s7)
   added: (at truck3 s2)
   goals met: 14 of 33
49. (load-truck s2 package21 truck3)
   deleted: (at package21 s2)
   added: (in package21 truck3)
   goals met: 14 of 33
50. (load-truck s2 package19 truck3)
   deleted: (at package19 s2)
   added: (in package19 truck3)
   goals met: 14 of 33
51. (drive-truck driver3 s2 s0 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   goals met: 13 of 33
52. (drive-truck driver1 s1 s7 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s7)
   goals met: 13 of 33
53. (unload-truck s7 package28 truck1)
   deleted: (in package28 truck1)
   added: (at package28 s7)
   goals met: 14 of 33
54. (unload-truck s7 package18 truck1)
   deleted: (in package18 truck1)
   added: (at package18 s7)
   goals met: 15 of 33
55. (load-truck s0 package22 truck3)
   deleted: (at package22 s0)
   added: (in package22 truck3)
   goals met: 15 of 33
56. (unload-truck s0 package19 truck3)
   deleted: (in package19 truck3)
   added: (at package19 s0)
   goals met: 16 of 33
57. (drive-truck driver3 s0 s7 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s7)
   goals met: 16 of 33
58. (drive-truck driver1 s7 s4 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s4)
   goals met: 16 of 33
59. (drive-truck driver1 s4 s3 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   goals met: 17 of 33
60. (unload-truck s3 package12 truck1)
   deleted: (in package12 truck1)
   added: (at package12 s3)
   goals met: 18 of 33
61. (load-truck s3 package1 truck1)
   deleted: (at package1 s3)
   added: (in package1 truck1)
   goals met: 18 of 33
62. (drive-truck driver1 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 17 of 33
63. (unload-truck s0 package1 truck1)
   deleted: (in package1 truck1)
   added: (at package1 s0)
   goals met: 18 of 33
64. (drive-truck driver1 s0 s7 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s7)
   goals met: 18 of 33
65. (drive-truck driver1 s7 s5 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s5)
   goals met: 18 of 33
66. (unload-truck s5 package25 truck1)
   deleted: (in package25 truck1)
   added: (at package25 s5)
   goals met: 19 of 33
67. (unload-truck s5 package23 truck1)
   deleted: (in package23 truck1)
   added: (at package23 s5)
   goals met: 20 of 33
68. (load-truck s5 package20 truck1)
   deleted: (at package20 s5)
   added: (in package20 truck1)
   goals met: 20 of 33
69. (drive-truck driver1 s5 s1 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   goals met: 20 of 33
70. (drive-truck driver1 s1 s4 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   goals met: 20 of 33
71. (load-truck s4 package30 truck1)
   deleted: (at package30 s4)
   added: (in package30 truck1)
   goals met: 20 of 33
72. (load-truck s4 package15 truck1)
   deleted: (at package15 s4)
   added: (in package15 truck1)
   goals met: 20 of 33
73. (drive-truck driver1 s4 s1 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   goals met: 20 of 33
74. (drive-truck driver1 s1 s6 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s6)
   goals met: 20 of 33
75. (unload-truck s6 package15 truck1)
   deleted: (in package15 truck1)
   added: (at package15 s6)
   goals met: 21 of 33
76. (unload-truck s7 package22 truck3)
   deleted: (in package22 truck3)
   added: (at package22 s7)
   goals met: 22 of 33
77. (drive-truck driver1 s6 s1 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s1)
   goals met: 22 of 33
78. (unload-truck s1 package20 truck1)
   deleted: (in package20 truck1)
   added: (at package20 s1)
   goals met: 23 of 33
79. (drive-truck driver1 s1 s7 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s7)
   goals met: 23 of 33
80. (unload-truck s7 package30 truck1)
   deleted: (in package30 truck1)
   added: (at package30 s7)
   goals met: 24 of 33
81. (drive-truck driver1 s7 s2 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s2)
   goals met: 24 of 33
82. (unload-truck s2 package29 truck1)
   deleted: (in package29 truck1)
   added: (at package29 s2)
   goals met: 25 of 33
83. (drive-truck driver1 s2 s6 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   goals met: 25 of 33
84. (drive-truck driver1 s6 s3 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s3)
   goals met: 26 of 33
85. (drive-truck driver1 s3 s4 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s4)
   goals met: 25 of 33
86. (load-truck s4 package11 truck1)
   deleted: (at package11 s4)
   added: (in package11 truck1)
   goals met: 25 of 33
87. (drive-truck driver1 s4 s3 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s3)
   goals met: 26 of 33
88. (drive-truck driver1 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 25 of 33
89. (unload-truck s0 package11 truck1)
   deleted: (in package11 truck1)
   added: (at package11 s0)
   goals met: 26 of 33
90. (drive-truck driver1 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 27 of 33
91. (drive-truck driver3 s7 s5 truck3)
   deleted: (at truck3 s7)
   added: (at truck3 s5)
   goals met: 27 of 33
92. (unload-truck s5 package21 truck3)
   deleted: (in package21 truck3)
   added: (at package21 s5)
   goals met: 28 of 33
93. (drive-truck driver3 s5 s7 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s7)
   goals met: 28 of 33
94. (disembark-truck driver3 s7 truck3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s7) (empty truck3)
   goals met: 29 of 33
95. (drive-truck driver1 s3 s1 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 28 of 33
96. (drive-truck driver1 s1 s5 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s5)
   goals met: 28 of 33
97. (unload-truck s5 package10 truck1)
   deleted: (in package10 truck1)
   added: (at package10 s5)
   goals met: 29 of 33
98. (drive-truck driver1 s5 s1 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s1)
   goals met: 29 of 33
99. (drive-truck driver1 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 30 of 33
100. (disembark-truck driver1 s3 truck1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s3) (empty truck1)
   goals met: 30 of 33
101. (board-truck driver1 s3 truck2)
   deleted: (at driver1 s3) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 30 of 33
102. (drive-truck driver1 s3 s6 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s6)
   goals met: 30 of 33
103. (drive-truck driver1 s6 s7 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s7)
   goals met: 31 of 33
104. (board-truck driver3 s7 truck3)
   deleted: (at driver3 s7) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 30 of 33
105. (disembark-truck driver1 s7 truck2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s7) (empty truck2)
   goals met: 30 of 33
106. (disembark-truck driver3 s7 truck3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s7) (empty truck3)
   goals met: 31 of 33
107. (walk driver3 s7 p7-3)
   deleted: (at driver3 s7)
   added: (at driver3 p7-3)
   goals met: 30 of 33
108. (board-truck driver1 s7 truck3)
   deleted: (at driver1 s7) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 30 of 33
109. (drive-truck driver1 s7 s2 truck3)
   deleted: (at truck3 s7)
   added: (at truck3 s2)
   goals met: 31 of 33
110. (walk driver3 p7-3 s3)
   deleted: (at driver3 p7-3)
   added: (at driver3 s3)
   goals met: 31 of 33
111. (board-truck driver3 s3 truck1)
   deleted: (at driver3 s3) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 31 of 33
112. (drive-truck driver3 s3 s6 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s6)
   goals met: 30 of 33
113. (drive-truck driver3 s6 s2 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s2)
   goals met: 30 of 33
114. (unload-truck s2 package26 truck1)
   deleted: (in package26 truck1)
   added: (at package26 s2)
   goals met: 31 of 33
115. (drive-truck driver3 s2 s6 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s6)
   goals met: 31 of 33
116. (drive-truck driver3 s6 s3 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s3)
   goals met: 32 of 33
117. (disembark-truck driver3 s3 truck1)
   deleted: (driving driver3 truck1)
   added: (at driver3 s3) (empty truck1)
   goals met: 32 of 33
118. (walk driver3 s3 p7-3)
   deleted: (at driver3 s3)
   added: (at driver3 p7-3)
   goals met: 32 of 33
119. (walk driver3 p7-3 s7)
   deleted: (at driver3 p7-3)
   added: (at driver3 s7)
   goals met: 33 of 33
